Repository: jeanmasso/hyperloop-nc
Catalog: src/locale/messages.*.xlf
Languages: es, fr

source: Modern Transport in New Caledonia
es: Transporte Moderno en Nueva Caledonia
fr: Transport Moderne en Nouvelle-Calédonie

source: Discover a new way to travel across the islands of New Caledonia with our revolutionary transport system.
es: Descubre una nueva forma de viajar por las islas de Nueva Caledonia con nuestro sistema de transporte revolucionario.
fr: Découvrez une nouvelle façon de voyager à travers les îles de Nouvelle-Calédonie avec notre système de transport révolutionnaire.

source: Search a trip
es: Buscar un viaje
fr: Rechercher un trajet

source: View schedules
es: Ver horarios
fr: Voir les horaires

source: Our Services
es: Nuestros Servicios
fr: Nos Services

source: Fast Transport
es: Transporte Rápido
fr: Transport Rapide

source: Travel quickly between all stations in New Caledonia
es: Viaja rápidamente entre todas las estaciones de Nueva Caledonia
fr: Voyagez rapidement entre toutes les stations de Nouvelle-Calédonie

source: Flexible Schedules
es: Horarios Flexibles
fr: Horaires Flexibles

source: Multiple daily departures to all destinations
es: Múltiples salidas diarias hacia todos los destinos
fr: Multiples départs quotidiens vers toutes les destinations

source: Multiple Classes
es: Múltiples Clases
fr: Plusieurs Classes

source: Choose between 1st, 2nd and 3rd class according to your needs
es: Elige entre 1ª, 2ª y 3ª clase según tus necesidades
fr: Choisissez entre 1ère, 2ème et 3ème classe selon vos besoins

source: Main Destinations
es: Destinos Principales
fr: Destinations Principales

source: From Nouméa to Koumac, discover all of Grande-Terre
es: De Nouméa a Koumac, descubre toda Grande-Terre
fr: De Nouméa à Koumac, découvrez toute la Grande-Terre

source: Loyalty Islands
es: Islas Loyauté
fr: Îles Loyauté

source: Lifou, Maré, Ouvéa - The pearls of the Pacific
es: Lifou, Maré, Ouvéa - Las perlas del Pacífico
fr: Lifou, Maré, Ouvéa - Les perles du Pacifique

source: Isle of Pines
es: Isla de los Pinos
fr: Île des Pins

source: The island closest to paradise
es: La isla más cercana al paraíso
fr: L'île la plus proche du paradis

source: 💰 Transport Fares
es: 💰 Tarifas de Transporte
fr: 💰 Tarifs de Transport

source: Check all transport fares between stations in New Caledonia
es: Consulta todas las tarifas de transporte entre estaciones de Nueva Caledonia
fr: Consultez tous les tarifs de transport entre les stations de Nouvelle-Calédonie

source: 🕐 Train Schedules
es: 🕐 Horarios de Trenes
fr: 🕐 Horaires des Trains

source: Check all departure and arrival times to plan your trip in New Caledonia
es: Consulta todos los horarios de salida y llegada para planificar tu viaje en Nueva Caledonia
fr: Consultez tous les horaires de départ et d'arrivée pour planifier votre voyage en Nouvelle-Calédonie

source: 🔍 Trip Search
es: 🔍 Búsqueda de Viajes 🔍 Búsqueda de Viajes
fr: 🔍 Recherche de Trajets

source: Find the perfect trip for your journey in New Caledonia
es: Encuentra el viaje perfecto para tu aventura en Nueva Caledonia
fr: Trouvez le trajet parfait pour votre voyage en Nouvelle-Calédonie

source: 🎯 Your search criteria
es: 🎯 Tus criterios de búsqueda
fr: 🎯 Vos critères de recherche

source: Select your trip and preferences
es: Selecciona tu viaje y preferencias
fr: Sélectionnez votre trajet et vos préférences

source: 🚉 Transport Stations
es: 🚉 Estaciones de Transporte
fr: 🚉 Stations de Transport

source: Discover all the stations in the New Caledonia transport network with their lines and connections
es: Descubre todas las estaciones de la red de transporte de Nueva Caledonia con sus líneas y conexiones
fr: Découvrez toutes les stations du réseau de transport de Nouvelle-Calédonie avec leurs lignes et connexions

# footer.description
source: Modern and eco-friendly transportation in New Caledonia
es: Transporte moderno y ecológico en Nueva Caledonia
fr: Transport moderne et écologique en Nouvelle-Calédonie

# footer.quick-links
source: Quick Links
es: Enlaces Rápidos
fr: Liens Rapides

# footer.home
source: Home
es: Inicio
fr: Accueil

# footer.search
source: Search
es: Buscar
fr: Rechercher

# footer.schedules
source: Schedules
es: Horarios
fr: Horaires

# footer.prices
source: Prices
es: Precios
fr: Tarifs

# footer.destinations
source: Destinations
es: Destinos

# footer.loyalty-islands
source: Loyalty Islands
es: Islas Loyauté
fr: Îles Loyauté

# footer.isle-of-pines
source: Isle of Pines
es: Isla de los Pinos
fr: Île des Pins

# footer.all-stations
source: All stations
es: Todas las estaciones
fr: Toutes les stations

# footer.contact
source: Contact
es: Contacto

# footer.location
source: Nouméa, New Caledonia
es: Nouméa, Nueva Caledonia
fr: Nouméa, Nouvelle-Calédonie

# footer.copyright
source: © 2025 Hyperloop NC. All rights reserved.
es: © 2025 Hyperloop NC. Todos los derechos reservados.
fr: © 2025 Hyperloop NC. Tous droits réservés.

# footer.legal
source: Legal notices
es: Avisos legales
fr: Mentions légales

# footer.privacy
source: Privacy policy
es: Política de privacidad
fr: Politique de confidentialité

# footer.terms
source: Terms of use
es: Términos de uso
fr: Conditions d'utilisation

# language.code
source: EN
es: ES
fr: FR

# nav.home
source: Home
es: Inicio
fr: Accueil

# nav.search
source: Search
es: Buscar
fr: Rechercher

# nav.schedules
source: Schedules
es: Horarios
fr: Horaires

# nav.prices
source: Prices
es: Precios
fr: Tarifs

# nav.stations
source: Stations
es: Estaciones

# search.departure-station
source: Departure station
es: Estación de salida
fr: Station de départ

# search.choose-departure
source: Choose a departure station
es: Elegir una estación de salida
fr: Choisir une station de départ

# search.swap-stations
source: Swap stations
es: Intercambiar estaciones
fr: Échanger les stations

# search.arrival-station
source: Arrival station
es: Estación de llegada
fr: Station d'arrivée

# search.choose-arrival
source: Choose an arrival station
es: Elegir una estación de llegada
fr: Choisir une station d'arrivée

# search.departure-date
source: Departure date
es: Fecha de salida
fr: Date de départ

# search.service-class
source: Service class
es: Clase de servicio
fr: Classe de service

# search.time-preference
source: Time preference
es: Preferencia horaria
fr: Préférence horaire

# search.reset
source: Reset
es: Reiniciar
fr: Réinitialiser

# search.searching
source: Searching...
es: Buscando...
fr: Recherche...

# search.search
source: Search
es: Buscar
fr: Rechercher

# search.results-title
source: 📋 Search results
es: 📋 Resultados de búsqueda
fr: 📋 Résultats de recherche

# search.results-count
source: {{ searchResults.length }} trip(s) found
es: {{ searchResults.length }} viaje(s) encontrado(s)
fr: {{ searchResults.length }} trajet(s) trouvé(s)

# search.no-results-title
source: No trip found
es: Ningún viaje encontrado
fr: Aucun trajet trouvé

# search.no-results-message
source: No trip matches your search criteria.
es: Ningún viaje coincide con sus criterios de búsqueda.
fr: Aucun trajet ne correspond à vos critères de recherche.

# search.suggestions-title
source: Suggestions:
es: Sugerencias:

# search.suggestion-1
source: Check the selected stations
es: Verifique las estaciones seleccionadas
fr: Vérifiez les stations sélectionnées

# search.suggestion-2
source: Try another service class
es: Pruebe otra clase de servicio
fr: Essayez une autre classe de service

# search.suggestion-3
source: Change your time preferences
es: Cambie sus preferencias horarias
fr: Modifiez vos préférences horaires

# search.welcome-title
source: Ready to travel?
es: ¿Listo para viajar?
fr: Prêt à voyager ?

# search.welcome-message
source: Select your departure and arrival stations to start your trip search.
es: Seleccione sus estaciones de salida y llegada para comenzar su búsqueda de viaje.
fr: Sélectionnez vos stations de départ et d'arrivée pour commencer votre recherche de trajet.

# search.feature-fast
source: Fast search
es: Búsqueda rápida
fr: Recherche rapide

# search.feature-classes
source: All classes
es: Todas las clases
fr: Toutes les classes

# search.feature-flexible
source: Flexible schedules
es: Horarios flexibles
fr: Horaires flexibles

# schedules.loading
source: Loading schedules...
es: Cargando horarios...
fr: Chargement des horaires...

# schedules.tab-south
source: To the South
es: Hacia el Sur
fr: Vers le Sud

# schedules.tab-north
source: To the North
es: Hacia el Norte
fr: Vers le Nord

# schedules.tab-islands
source: To the Islands
es: Hacia las Islas
fr: Vers les Îles

# schedules.station
source: Station
es: Estación

# schedules.schedule
source: Schedule
es: Horario
fr: Horaire

# schedules.no-south-title
source: No schedule to the South
es: Ningún horario hacia el Sur
fr: Aucun horaire vers le Sud

# schedules.no-south-message
source: No train goes to the South.
es: Ningún tren va hacia el Sur.
fr: Aucun train ne va vers le Sud.

# schedules.no-north-title
source: No schedule to the North
es: Ningún horario hacia el Norte
fr: Aucun horaire vers le Nord

# schedules.no-north-message
source: No train goes to the North.
es: Ningún tren va hacia el Norte.
fr: Aucun train ne va vers le Nord.

# schedules.no-islands-title
source: No schedule to the Islands
es: Ningún horario hacia las Islas
fr: Aucun horaire vers les Îles

# schedules.no-islands-message
source: No train goes to the islands.
es: Ningún tren va hacia las islas.
fr: Aucun train ne va vers les îles.

# prices.loading
source: Loading...
es: Cargando...

# prices.first-class-alt
source: First Class
es: Primera Clase
fr: Première Classe

# prices.first-class
source: First Class
es: Primera Clase
fr: Première Classe

# prices.leather-seats
source: Leather seats
es: Asientos de cuero

# prices.panoramic-windows
source: Panoramic windows
es: Ventanas panorámicas

# prices.concierge-service
source: Concierge service
es: Servicio de conserjería

# prices.champagne-service
source: Champagne service
es: Servicio de champán

# prices.gourmet-meals
source: Gourmet meals
es: Comidas gourmet

# prices.wifi-entertainment
source: WiFi and entertainment
es: WiFi y entretenimiento

# prices.private-cabins
source: Private cabins
es: Cabinas privadas

# prices.second-class-alt
source: Second Class
es: Segunda Clase
fr: Deuxième Classe

# prices.second-class
source: Second Class
es: Segunda Clase
fr: Deuxième Classe

# prices.recommended-badge
source: Recommended
es: Recomendado
fr: Recommandé

# prices.comfortable-seats
source: Comfortable seats
es: Asientos cómodos
fr: Sièges confortables

# prices.snacks-available
source: Snacks available
es: Aperitivos disponibles
fr: Collations disponibles

# prices.air-conditioning
source: Air conditioning
es: Aire acondicionado
fr: Climatisation

# prices.power-outlets
source: Power outlets
es: Tomas de corriente
fr: Prises électriques

# prices.trip-information
source: Trip information
es: Información del viaje
fr: Informations de trajet

# prices.third-class-alt
source: Third Class
es: Tercera Clase
fr: Troisième Classe

# prices.third-class
source: Third Class
es: Tercera Clase
fr: Troisième Classe

# prices.economy-badge
source: Economy
es: Económico
fr: Économique

# prices.standard-seats
source: Standard seats
es: Asientos estándar
fr: Sièges standards

# prices.onboard-toilets
source: Onboard toilets
es: Baños a bordo
fr: Toilettes à bord

# prices.voice-announcements
source: Voice announcements
es: Anuncios de voz
fr: Annonces vocales

# prices.emergency-service
source: Emergency service
es: Servicio de emergencia
fr: Service d'urgence

# prices.luggage-lockers
source: Luggage lockers
es: Casilleros de equipaje
fr: Casiers à bagages

# prices.fares-displayed-for
source: Fares displayed for:
es: Tarifas mostradas para:
fr: Tarifs affichés pour :

# prices.filter-by-location
source: 📍 Filter by geographical area
es: 📍 Filtrar por área geográfica
fr: 📍 Filtrer par zone géographique

# prices.select-location-description
source: Select a geographical area of New Caledonia
es: Selecciona un área geográfica de Nueva Caledonia
fr: Sélectionnez une zone géographique de Nouvelle-Calédonie

# prices.fares-by-class
source: 💰 Fares by class:
es: 💰 Tarifas por clase:
fr: 💰 Tarifs par classe :

# prices.distance
source: Distance:
es: Distancia:

# prices.price-per-km
source: Price per km (2nd class):
es: Precio por km (2ª clase):
fr: Prix au km (2e classe) :

# prices.islands-served
source: 🏝️ Islands served:
es: 🏝️ Islas servidas:
fr: 🏝️ Îles desservies :

# prices.no-fares-found
source: No fare found
es: No se encontró tarifa
fr: Aucun tarif trouvé

# prices.no-fares-message
source: No fare is available for the area {{ getLocationTabLabel(activeLocationTab) }} in {{ getServiceClassLabel(activeTab) }}.
es: No hay tarifa disponible para el área {{ getLocationTabLabel(activeLocationTab) }} en {{ getServiceClassLabel(activeTab) }}.
fr: Aucun tarif n'est disponible pour la zone {{ getLocationTabLabel(activeLocationTab) }} en {{ getServiceClassLabel(activeTab) }}.

source: Loading stations...
es: Cargando estaciones...
fr: Chargement des stations...

source: Main Island
es: Isla Principal
fr: Grande-Terre

source: Pine Island
es: Isla de los Pinos
fr: Île des Pins

source: lines
es: líneas
fr: lignes

source: 🚇 Lines served:
es: 🚇 Líneas servidas:
fr: 🚇 Lignes desservies :

source: 📍 Coordinates:
es: 📍 Coordenadas:
fr: 📍 Coordonnées :

source: No stations found
es: No se encontraron estaciones
fr: Aucune station trouvée

source: No stations are available for this region.
es: No hay estaciones disponibles para esta región.
fr: Aucune station n'est disponible pour cette région.

source: First Class
es: Primera Clase
fr: Première Classe

source: Second Class
es: Segunda Clase
fr: Deuxième Classe

source: Third Class
es: Tercera Clase
fr: Troisième Classe

# prices.service-classes-title
source: 🎭 Service Classes
es: 🎭 Clases de Servicio
fr: 🎭 Classes de Service

# prices.service-classes-description
source: Discover our different transport classes adapted to all budgets
es: Descubre nuestras diferentes clases de transporte adaptadas a todos los presupuestos
fr: Découvrez nos différentes classes de transport adaptées à tous les budgets

# prices.premium-seats
source: Premium leather seats
es: Asientos de cuero premium
fr: Sièges en cuir premium

# prices.catering-service
source: Catering service
es: Servicio de catering
fr: Service de restauration

# prices.free-wifi
source: Free Wi-Fi
es: Wi-Fi gratuito
fr: Wi-Fi gratuit

# prices.personal-entertainment
source: Personal entertainment
es: Entretenimiento personal
fr: Divertissement personnel

# prices.priority-luggage
source: Priority luggage
es: Equipaje prioritario
fr: Bagages prioritaires

# prices.starting-from
source: Starting from
es: Desde
fr: À partir de

# prices.loading
source: Loading fares...
fr: Chargement des tarifs...
